/*
Южный федеральный университет, ИКТИБ, кафедра МОП ЭВМ
Группа: КТбо1-8 Нестеренко П.А
Задание: D
Дата: 05.10.2019
*/

#include <stdio.h>

int main(void)
{
    int a, b;
    scanf("%d %d",&a,&b);
    int c = ((a%2 == 0) && (b%2 == 0))||((a%2 !=0) && (b%2 !=0));
    printf("%d\n",c);
    unsigned long long d = a * b * c;
    //d = a * b * (a % 2 + b % 2 +1) % 2; Кутовой придумал код!!!
    printf("%u",d);
    return 0;
}
