/*
Южный федеральный университет, ИКТИБ, кафедра МОП ЭВМ
Группа: КТбо1-8 Нестеренко П.А
Задание: C
Дата: 05.10.2019
*/

#include <stdio.h>

int main(void)
{
    int a;
    scanf("%d",&a);
    int b = a/1000;
    int c = (a - b*1000)/100;
    int d = (a - b*1000 - c *100)/10;
    int e = a % 10;
    a = b * 1000 + d * 100 + c * 10 + e;
    printf("%d",a);
    return 0;
}