/*
Южный федеральный университет, ИКТИБ, кафедра МОП ЭВМ
Группа: КТбо1-8 Нестеренко П.А
Задание: I. Общие множители
Дата: 25.01.2020
*/
#include <iostream>

using namespace std;

int main()
{
    long long int n;
    double m;
    cin>>m>>n;
    
    for(int i = 0;i < n;i++)
        m = m * 0.95
    
    printf("%0.2f",m);
    return 0;
}